<script setup lang="ts">
import Dropdown from '~/entities/dropdown/ui/dropdown.vue';

const metaData = [
  {
    id: 1,
    title:
      'Авторская мастерская «Настольные игры как полезный досуг молодежи в библиотеке»',
    content: `Цель авторской мастерской – обобщение и трансляция опыта работы с настольными играми в библиотеке как одного из методов привлечения молодых читателей.
Докладчик – Шевцов Никита Сергеевич, начальник Центра поддержки культурных инициатив молодежи Новосибирской областной молодежной библиотеки.
Основные вопросы для обсуждения:
–\tкатегории настольных игр, их правила и механика;
–\tплюсы и минусы различных форматов предоставления настольных игр посетителям библиотеки;
–\tсвязь личностных качеств посетителей и их предпочтений в настольных играх;
–\tэффективные методы организации игротеки.
Даны рекомендации, позволяющие выстроить в библиотеках эффективную систему работы с настольными играми для увеличения числа пользователей библиотеки.
;
`,
    date: '28.03.2024',
    link: 'http://dev.infomania.ru/entry/nastolnye-igry-klyuch-k-razvlecheniyu-i-razvitiyu-molodezhi-v-biblioteke-2024-03-30',
  },
  {
    id: 1,
    title:
      'Семинар-практикум «Контент в соцсетях: что делать, чтобы вас читали»',
    content: `Цель мероприятия – повышение уровня профессиональных компетенций специалистов библиотек по вопросам организации работы в социальных сетях.
В ходе семинара отражено множество аспектов работы с соцсетями современной библиотеки.
Докладчиками стали сотрудники Новосибирской областной молодежной библиотеки – ведущий специалист по связям с общественностью Баурина Ксения Александровна, редактор Ильина Мария Владимировна, а также корреспондент пресс-центра Новосибирского государственного педагогического университета Терентьев Александр Владимирович.
`,
    date: '28.02.2024',
    link: 'http://dev.infomania.ru/entry/nastolnye-igry-klyuch-k-razvlecheniyu-i-razvitiyu-molodezhi-v-biblioteke-2024-03-30',
  },
  {
    id: 1,
    title:
      'Вебинар «Как сделать книжную подборку, чтобы ее не забыли в закладках: от выбора темы до исполнения»',
    content: `Цель вебинара – презентация опыта создания книжных подборок для читателей и их размещение на различных ресурсах в сети Интернет.
Посмотрев вебинар, библиотекари смогут грамотно составить книжную подборку, определить оптимальное количество книг, показать свое мнение о них и, конечно, поделиться хорошими книгами со своими читателями.
Лектором выступает Полянская Ангелина Анатольевна, ведущий библиотекарь отдела гуманитарной литературы Алтайской краевой универсальной научной библиотеки им. Шишкова.
`,
    date: '28.02.2024',
    link: 'http://dev.infomania.ru/entry/nastolnye-igry-klyuch-k-razvlecheniyu-i-razvitiyu-molodezhi-v-biblioteke-2024-03-30',
  },
];
</script>

<template>
  <div class="virtual">
    <header class="header">
      <div class="title">Виртуальный семинар</div>
      <div class="description">
        Новосибирская областная молодежная библиотека ежегодно проводит
        профессиональные мероприятия для специалистов библиотек, которые носят
        практико-ориентированный характер и дают ответы на возникающие вопросы
        специалистов библиотек в процессе реализации профессиональной
        деятельности. В данном разделе представлены вебинары, семинары,
        авторские мастерские по актуальным направлениям деятельности за период с
        2021 года по настоящее время.
      </div>
    </header>
    <div class="body">
      <dropdown
        v-for="item in metaData"
        :key="item.id"
        :title="item.title"
        :content="item.content"
        :date="item.date"
      />
    </div>
  </div>
</template>

<style scoped lang="scss">
.virtual {
  .header {
    .title {
      @apply text-xl font-bold mb-2;
    }
  }

  .seminar {
    &__title {
      @apply text-lg font-bold;
    }
  }
}
</style>
